fishes_config/src/Documents/ПокупкаКорма/ПокупкаКорма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаКорма</name>
  <registerRecords>AccumulationRegister.ОстаткиПоРыбе</registerRecords>
  <attributes>
    <name>Аквариум</name>
    <type>
      <types>CatalogRef.Аквариумы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fishes_config/src/AccumulationRegisters/ОстаткиПоРыбе/ОстаткиПоРыбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоРыбе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аквариум</name>
    <type>
      <types>CatalogRef.Аквариумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПородаРыб</name>
    <type>
      <types>CatalogRef.ПородыРыб</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fishes_config/src/Documents/ПокупкаКорма/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПоРыбе.Записывать = Истина;
	
	ЗапросПоОстаткам = Новый Запрос;
	ЗапросПоОстаткам.Текст = 
		"ВЫБРАТЬ
		|	т.ПородаРыб КАК Порода,
		|	т.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиПоРыбе.Остатки(&МоментВремени, Аквариум = &Аквариум) КАК т
		|ГДЕ
		|	т.КоличествоОстаток > 0";
	ЗапросПоОстаткам.УстановитьПараметр("МоментВремени", МоментВремени());
	ЗапросПоОстаткам.УстановитьПараметр("Аквариум", Аквариум);
	Результат = ЗапросПоОстаткам.Выполнить();
	
	ОбщееКоличество = 0;
	Таблица = Результат.Выгрузить();
	
	Для Каждого Строка Из Таблица Цикл
		ОбщееКоличество = ОбщееКоличество + Строка.Количество;
	КонецЦикла;
		
	Если ОбщееКоличество <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Таблица Цикл
		ДоляКорма = СтоимостьКорма * Строка.Количество / ОбщееКоличество;
		
		Движение = Движения.ОстаткиПоРыбе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Аквариум = Аквариум;
		Движение.ПородаРыб = Строка.Порода;
		Движение.Количество = 0;
		Движение.Стоимость = ДоляКорма;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
